In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("Sample data.csv")

In [3]:
data

    Name   Age      sal group
0   sree  32.0  10000.0     F
1  kumar   NaN  20000.0     G
2   raju  56.0      NaN     H
3   hari   NaN  33222.0     L
4  kummu  56.0      NaN     M

In [11]:
sda= pd.read_excel("Sample..xlsx",sheetname=None)

In [12]:
sda

{'Sheet1':     Name  Age     sal group
 0   sree   32   10000     F
 1  kumar   25   20000     G
 2   raju   56  145000     H
 3   hari   22   33222     L
 4  kummu   56   21000     M, 'Sheet2':     Name  Age    sal group
 0  babu    21  25000     B
 1   ravi   22  25600     V
 2  pappu   23  26200     J
 3  gindu   24  26800     k}

In [13]:
type(sda)

dict

In [14]:
sda.keys()

dict_keys(['Sheet1', 'Sheet2'])

In [15]:
df=pd.DataFrame(sda["Sheet1"])

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df1=pd.DataFrame(sda["Sheet2"])

In [19]:
df1

    Name  Age    sal group
0  babu    21  25000     B
1   ravi   22  25600     V
2  pappu   23  26200     J
3  gindu   24  26800     k

In [22]:
df.append(df1,ignore_index=True)

    Name  Age     sal group
0   sree   32   10000     F
1  kumar   25   20000     G
2   raju   56  145000     H
3   hari   22   33222     L
4  kummu   56   21000     M
5  babu    21   25000     B
6   ravi   22   25600     V
7  pappu   23   26200     J
8  gindu   24   26800     k